In [162]:
# it's powerful data manipulation library
# widely used for data analysis and data cleaning
# it provides two primary data structures: Series and DataFrame
# A series is a 1D array like object while Dataframe is a 2D (rows & columns)

In [163]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [164]:
import pandas as pd

In [165]:
## series

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [166]:
## dictionary

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [167]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [168]:
## Dataframe
## create a dataframe from a dict of list

data={
    'Name':['Binal','Bhoomi','Riya'],
    'Age':[25,30,45],
    'city':['Banglore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      city
0   Binal   25  Banglore
1  Bhoomi   30  New York
2    Riya   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [169]:
## create a dataframe from a list of dict

data=[
    {'Name':'Binal','Age':32,'city':'Banglore'}, 
    {'Name':'Bhoomi','Age':33,'city':'New York'},
    {'Name':'Riya','Age':34,'city':'Florida'},
    {'Name':'Drashti','Age':35,'city':'Chikago'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago
<class 'pandas.core.frame.DataFrame'>

In [170]:
import pandas as pd
df = pd.read_csv("sales_data_sample.csv", encoding="latin1", sep=None, engine="python")
print(df.head())

                                                   | Unnamed: 1 Unnamed: 2  \
0  | ORDERNUMBER | QUANTITYORDERED | PRICEEACH | ...       None       None
1                                                  |        NaN        NaN
2  |       10107 |              30 |      95.7 | ...       None       None
3                                                  |        NaN        NaN
4  |       10121 |              34 |     81.35 | ...       None       None

  Unnamed: 3 Unnamed: 4  Unnamed: 5  Unnamed: 6  Unnamed: 7  Unnamed: 8  \
0       None       None         NaN         NaN         NaN         NaN
1        NaN        NaN         NaN         NaN         NaN         NaN
2       None       None         NaN         NaN         NaN         NaN
3        NaN        NaN         NaN         NaN         NaN         NaN
4       None       None         NaN         NaN         NaN         NaN

   Unnamed: 9  ...  Unnamed: 376  Unnamed: 377  Unnamed: 378 Unnamed: 379  \
0         NaN  ...           NaN           NaN           NaN          NaN
1         NaN  ...           NaN           NaN           NaN          NaN
2         NaN  ...           NaN           NaN           NaN          NaN
3         NaN  ...           NaN           NaN           NaN          NaN
4         NaN  ...           NaN           NaN           NaN          NaN

   Unnamed: 380  Unnamed: 381  Unnamed: 382  Unnamed: 383  Unnamed: 384  |.25
0           NaN           NaN           NaN           NaN           NaN  None
1           NaN           NaN           NaN           NaN           NaN     |
2           NaN           NaN           NaN           NaN           NaN  None
3           NaN           NaN           NaN           NaN           NaN     |
4           NaN           NaN           NaN           NaN           NaN  None

[5 rows x 386 columns]

In [171]:
df.tail(5)

,|,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384,|.25
5643,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
5644,| 10397 | 34 | 62.24 | ...,Lorraine | |...,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
5645,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
5646,| 10414 | 47 | 65.52 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
5647,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|

In [172]:
## accessing data from dataframe
df=pd.DataFrame(data)

In [173]:
data

[{'Name': 'Binal', 'Age': 32, 'city': 'Banglore'},
 {'Name': 'Bhoomi', 'Age': 33, 'city': 'New York'},
 {'Name': 'Riya', 'Age': 34, 'city': 'Florida'},
 {'Name': 'Drashti', 'Age': 35, 'city': 'Chikago'}]

In [174]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [175]:
df['Name']

0      Binal
1     Bhoomi
2       Riya
3    Drashti
Name: Name, dtype: object

In [176]:
df.loc[0]    ## row index

Name       Binal
Age           32
city    Banglore
Name: 0, dtype: object

In [177]:
df.iloc[0][2]    ## specific index

/tmp/ipykernel_25756/2412317762.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]    ## specific index

'Banglore'

In [178]:
df.loc[0][0]

/tmp/ipykernel_25756/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Binal'

In [179]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [180]:
## accessing a specified element
print(df.at[2,'Age'])

34

In [181]:
print(df.at[2,'Name'])

Riya

In [182]:
## accessing a specified element using iat
print(df.iat[2,2])

Florida

In [183]:
### data manipulation with dataframe
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [184]:
df['Salary']=[50000,60000,70000,80000]
df

      Name  Age      city  Salary
0    Binal   32  Banglore   50000
1   Bhoomi   33  New York   60000
2     Riya   34   Florida   70000
3  Drashti   35   Chikago   80000

In [185]:
## remove a column
df.drop('Salary',axis=1,inplace=True)  ## drop is temporary operation so use inplace=True for permenent

In [186]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [187]:
## add age to the column
df['Age']=df['Age']+1
df

      Name  Age      city
0    Binal   33  Banglore
1   Bhoomi   34  New York
2     Riya   35   Florida
3  Drashti   36   Chikago

In [188]:
df.drop(0,inplace=True)

In [189]:
df

      Name  Age      city
1   Bhoomi   34  New York
2     Riya   35   Florida
3  Drashti   36   Chikago

In [190]:
import pandas as pd
df = pd.read_csv("sales_data_sample.csv", encoding="latin1", sep=None, engine="python")
df.head(5)

,|,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384,|.25
0,| ORDERNUMBER | QUANTITYORDERED | PRICEEACH | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
1,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
2,| 10107 | 30 | 95.7 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
3,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
4,| 10121 | 34 | 81.35 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None

In [191]:
# Display the data types of each column
print("Data types:\n",df.dtypes)

# Descibes the dataframe
print("stastical sumary:\n",df.describe())

Data types:
 |                object
Unnamed: 1       object
Unnamed: 2       object
Unnamed: 3       object
Unnamed: 4       object
                 ...
Unnamed: 381    float64
Unnamed: 382    float64
Unnamed: 383    float64
Unnamed: 384    float64
|.25             object
Length: 386, dtype: object
stastical sumary:
        Unnamed: 5  Unnamed: 6  Unnamed: 7  Unnamed: 8  Unnamed: 9  \
count         0.0         0.0         0.0         0.0         0.0
mean          NaN         NaN         NaN         NaN         NaN
std           NaN         NaN         NaN         NaN         NaN
min           NaN         NaN         NaN         NaN         NaN
25%           NaN         NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN         NaN
max           NaN         NaN         NaN         NaN         NaN

       Unnamed: 10  Unnamed: 11  Unnamed: 12  Unnamed: 14  Unnamed: 15  ...  \
count          0.0          0.0          0.0          0.0          0.0  ...
mean           NaN          NaN          NaN          NaN          NaN  ...
std            NaN          NaN          NaN          NaN          NaN  ...
min            NaN          NaN          NaN          NaN          NaN  ...
25%            NaN          NaN          NaN          NaN          NaN  ...
50%            NaN          NaN          NaN          NaN          NaN  ...
75%            NaN          NaN          NaN          NaN          NaN  ...
max            NaN          NaN          NaN          NaN          NaN  ...

       Unnamed: 374  Unnamed: 376  Unnamed: 377  Unnamed: 378  Unnamed: 379  \
count           0.0           0.0           0.0           0.0           0.0
mean            NaN           NaN           NaN           NaN           NaN
std             NaN           NaN           NaN           NaN           NaN
min             NaN           NaN           NaN           NaN           NaN
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max             NaN           NaN           NaN           NaN           NaN

       Unnamed: 380  Unnamed: 381  Unnamed: 382  Unnamed: 383  Unnamed: 384
count           0.0           0.0           0.0           0.0           0.0
mean            NaN           NaN           NaN           NaN           NaN
std             NaN           NaN           NaN           NaN           NaN
min             NaN           NaN           NaN           NaN           NaN
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max             NaN           NaN           NaN           NaN           NaN

[8 rows x 356 columns]

In [192]:
df.describe()

,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 14,Unnamed: 15,...,Unnamed: 374,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384
count,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [193]:
import pandas as pd

In [194]:
df=pd.read_csv('sales_data.csv')

In [195]:
df.head(5)

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [196]:
df.tail(5)

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
995,1010,2023-04-15,Charlie,North,4733.88,4,Food,4943.03,5442.15,Returning,0.29,Cash,Online,North-Charlie
996,1067,2023-09-07,Bob,North,4716.36,37,Clothing,1754.32,1856.40,New,0.21,Bank Transfer,Retail,North-Bob
997,1018,2023-04-27,David,South,7629.70,17,Clothing,355.72,438.27,Returning,0.06,Bank Transfer,Online,South-David
998,1100,2023-12-20,David,West,1629.47,39,Electronics,3685.03,3743.39,New,0.01,Bank Transfer,Online,West-David
999,1086,2023-08-16,Alice,East,4923.93,48,Food,2632.58,2926.68,Returning,0.14,Cash,Online,East-Alice

In [197]:
df.describe()

,Product_ID,Sales_Amount,Quantity_Sold,Unit_Cost,Unit_Price,Discount
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,1050.128000,5019.265230,25.355000,2475.304550,2728.440120,0.15239
std,29.573505,2846.790126,14.159006,1417.872546,1419.399839,0.08720
min,1001.000000,100.120000,1.000000,60.280000,167.120000,0.00000
25%,1024.000000,2550.297500,13.000000,1238.380000,1509.085000,0.08000
50%,1051.000000,5019.300000,25.000000,2467.235000,2696.400000,0.15000
75%,1075.000000,7507.445000,38.000000,3702.865000,3957.970000,0.23000
max,1100.000000,9989.040000,49.000000,4995.300000,5442.150000,0.30000

In [198]:
df.dtypes

Product_ID                int64
Sale_Date                object
Sales_Rep                object
Region                   object
Sales_Amount            float64
Quantity_Sold             int64
Product_Category         object
Unit_Cost               float64
Unit_Price              float64
Customer_Type            object
Discount                float64
Payment_Method           object
Sales_Channel            object
Region_and_Sales_Rep     object
dtype: object

In [199]:
## handling missing value
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [200]:
df.isnull().sum()

Product_ID              0
Sale_Date               0
Sales_Rep               0
Region                  0
Sales_Amount            0
Quantity_Sold           0
Product_Category        0
Unit_Cost               0
Unit_Price              0
Customer_Type           0
Discount                0
Payment_Method          0
Sales_Channel           0
Region_and_Sales_Rep    0
dtype: int64

In [201]:
df_filled=df.fillna(0)

In [202]:
## filling missing values with the mean of the column

## none of the value is null in above data

In [203]:
df.dtypes

Product_ID                int64
Sale_Date                object
Sales_Rep                object
Region                   object
Sales_Amount            float64
Quantity_Sold             int64
Product_Category         object
Unit_Cost               float64
Unit_Price              float64
Customer_Type            object
Discount                float64
Payment_Method           object
Sales_Channel            object
Region_and_Sales_Rep     object
dtype: object

In [204]:
## renaming columns
df=df.rename(columns={'Sale_Date':'Sales Date'})
df=df.rename(columns={'Quantity_Sold':'New_Value'})
df.head()

,Product_ID,Sales Date,Sales_Rep,Region,Sales_Amount,New_Value,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [205]:
df['New_Value']=df['New_Value'].apply(lambda x:x*2)
df

,Product_ID,Sales Date,Sales_Rep,Region,Sales_Amount,New_Value,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,36,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,34,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,60,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,78,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,26,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1010,2023-04-15,Charlie,North,4733.88,8,Food,4943.03,5442.15,Returning,0.29,Cash,Online,North-Charlie
996,1067,2023-09-07,Bob,North,4716.36,74,Clothing,1754.32,1856.40,New,0.21,Bank Transfer,Retail,North-Bob
997,1018,2023-04-27,David,South,7629.70,34,Clothing,355.72,438.27,Returning,0.06,Bank Transfer,Online,South-David
998,1100,2023-12-20,David,West,1629.47,78,Electronics,3685.03,3743.39,New,0.01,Bank Transfer,Online,West-David
999,1086,2023-08-16,Alice,East,4923.93,96,Food,2632.58,2926.68,Returning,0.14,Cash,Online,East-Alice